MaJerle/stm32f429/00-STM32_SVD/STM32F301x.svd
dth><access>read-only</access></field><field><name>G8E</name><description>Analog I/O group x enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>G7E</name><description>Analog I/O group x enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>G6E</name><description>Analog I/O group x enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>G5E</name><description>Analog I/O group x enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>G4E</name><description>Analog I/O group x enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>G3E</name><description>Analog I/O group x enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>G2E</name><description>Analog I/O group x enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>G1E</name><description>Analog I/O group x enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>IOG1CR</name><displayName>IOG1CR</displayName><description>I/O group x counter register</description><addressOffset>0x34</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>CNT</name><description>Counter value</description><bitOffset>0</bitOffset><bitWidth>14</bitWidth></field></fields></register><register><name>IOG2CR</name><displayName>IOG2CR</displayName><description>I/O group x counter register</description><addressOffset>0x38</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>CNT</name><description>Counter value</description><bitOffset>0</bitOffset><bitWidth>14</bitWidth></field></fields></register><register><name>IOG3CR</name><displayName>IOG3CR</displayName><description>I/O group x counter register</description><addressOffset>0x3C</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>CNT</name><description>Counter value</description><bitOffset>0</bitOffset><bitWidth>14</bitWidth></field></fields></register><register><name>IOG4CR</name><displayName>IOG4CR</displayName><description>I/O group x counter register</description><addressOffset>0x40</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>CNT</name><description>Counter value</description><bitOffset>0</bitOffset><bitWidth>14</bitWidth></field></fields></register><register><name>IOG5CR</name><displayName>IOG5CR</displayName><description>I/O group x counter register</description><addressOffset>0x44</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>CNT</name><description>Counter value</description><bitOffset>0</bitOffset><bitWidth>14</bitWidth></field></fields></register><register><name>IOG6CR</name><displayName>IOG6CR</displayName><description>I/O group x counter register</description><addressOffset>0x48</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>CNT</name><description>Counter value</description><bitOffset>0</bitOffset><bitWidth>14</bitWidth></field></fields></register><register><name>IOG7CR</name><displayName>IOG7CR</displayName><description>I/O group x counter register</description><addressOffset>0x4C</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>CNT</name><description>Counter value</description><bitOffset>0</bitOffset><bitWidth>14</bitWidth></field></fields></register><register><name>IOG8CR</name><displayName>IOG8CR</displayName><description>I/O group x counter register</description><addressOffset>0x50</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>CNT</name><description>Counter value</description><bitOffset>0</bitOffset><bitWidth>14</bitWidth></field></fields></register></registers></peripheral><peripheral><name>CRC</name><description>cyclic redundancy check calculation unit</description><groupName>CRC</groupName><baseAddress>0x40023000</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><registers><register><name>DR</name><displayName>DR</displayName><description>Data register</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0xFFFFFFFF</resetValue><fields><field><name>DR</name><description>Data register bits</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>IDR</name><displayName>IDR</displayName><description>Independent data register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>IDR</name><description>General-purpose 8-bit data register               bits</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>CR</name><displayName>CR</displayName><description>Control register</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>RESET</name><description>reset bit</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>POLYSIZE</name><description>Polynomial size</description><bitOffset>3</bitOffset><bitWidth>2</bitWidth></field><field><name>REV_IN</name><description>Reverse input data</description><bitOffset>5</bitOffset><bitWidth>2</bitWidth></field><field><name>REV_OUT</name><description>Reverse output data</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>INIT</name><displayName>INIT</displayName><description>Initial CRC value</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0xFFFFFFFF</resetValue><fields><field><name>INIT</name><description>Programmable initial CRC               value</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>POL</name><displayName>POL</displayName><description>CRC polynomial</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x04C11DB7</resetValue><fields><field><name>POL</name><description>Programmable polynomial</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register></registers></peripheral><peripheral><name>Flash</name><description>Flash</description><groupName>Flash</groupName><baseAddress>0x40022000</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>FLASH</name><description>Flash global interrupt</description><value>4</value></interrupt><registers><register><name>ACR</name><displayName>ACR</displayName><description>Flash access control register</description><addressOffset>0x0</addressOffset><size>0x20</size><resetValue>0x00000030</resetValue><fields><field><name>LATENCY</name><description>LATENCY</description><bitOffset>0</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>PRFTBE</name><description>PRFTBE</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PRFTBS</name><description>PRFTBS</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>KEYR</name><displayName>KEYR</displayName><description>Flash key register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x00000000</resetValue><fields><field><name>FKEYR</name><description>Flash Key</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>OPTKEYR</name><displayName>OPTKEYR</displayName><description>Flash option key register</description><addressOffset>0x8</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x00000000</resetValue><fields><field><name>OPTKEYR</name><description>Option byte key</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>SR</name><displayName>SR</displayName><description>Flash status register</description><addressOffset>0xC</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>EOP</name><description>End of operation</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WRPRT</name><description>Write protection error</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PGERR</name><description>Programming error</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BSY</name><description>Busy</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>CR</name><displayName>CR</displayName><description>Flash control register</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000080</resetValue><fields><field><name>FORCE_OPTLOAD</name><description>Force option byte loading</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>EOPIE</name><description>End of operation interrupt               enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>ERRIE</name><description>Error interrupt enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>OPTWRE</name><description>Option bytes write enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>LOCK</name><description>Lock</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>STRT</name><description>Start</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>OPTER</name><description>Option byte erase</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>OPTPG</name><description>Option byte programming</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>MER</name><description>Mass erase</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>PER</name><description>Page erase</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>PG</name><description>Programming</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>AR</name><displayName>AR</displayName><description>Flash address register</description><addressOffset>0x14</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x00000000</resetValue><fields><field><name>FAR</name><description>Flash address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>OBR</name><displayName>OBR</displayName><description>Option byte register</description><addressOffset>0x1C</addressOffset><size>0x20</size><access>read-only</access><resetValue>0xFFFFFF02</resetValue><fields><field><name>OPTERR</name><description>Option byte error</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>LEVEL1_PROT</name><description>Level 1 protection status</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>LEVEL2_PROT</name><description>Level 2 protection status</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>WDG_SW</name><description>WDG_SW</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>nRST_STOP</name><description>nRST_STOP</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>nRST_STDBY</name><description>nRST_STDBY</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>BOOT1</name><description>BOOT1</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>VDDA_MONITOR</name><description>VDDA_MONITOR</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>SRAM_PARITY_CHECK</name><description>SRAM_PARITY_CHECK</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>Data0</name><description>Data0</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>Data1</name><description>Data1</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>WRPR</name><displayName>WRPR</displayName><description>Write protection register</description><addressOffset>0x20</addressOffset><size>0x20</size><access>read-only</access><resetValue>0xFFFFFFFF</resetValue><fields><field><name>WRP</name><description>Write protect</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register></registers></peripheral><peripheral><name>RCC</name><description>Reset and clock control</description><groupName>RCC</groupName><baseAddress>0x40021000</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>RCC</name><description>RCC global interrupt</description><value>5</value></interrupt><registers><register><name>CR</name><displayName>CR</displayName><description>Clock control register</description><addressOffset>0x0</addressOffset><size>0x20</size><resetValue>0x00000083</resetValue><fields><field><name>HSION</name><description>Internal High Speed clock               enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSIRDY</name><description>Internal High Speed clock ready               flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HSITRIM</name><description>Internal High Speed clock               trimming</description><bitOffset>3</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>HSICAL</name><description>Internal High Speed clock               Calibration</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth><access>read-only</access></field><field><name>HSEON</name><description>External High Speed clock               enable</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSERDY</name><description>External High Speed clock ready               flag</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HSEBYP</name><description>External High Speed clock               Bypass</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CSSON</name><description>Clock Security System               enable</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLON</name><description>PLL enable</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLRDY</name><description>PLL clock ready flag</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>CFGR</name><displayName>CFGR</displayName><description>Clock configuration register           (RCC_CFGR)</description><addressOffset>0x4</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>SW</name><description>System clock Switch</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>SWS</name><description>System Clock Switch Status</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field><field><name>HPRE</name><description>AHB prescaler</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>PPRE1</name><description>APB Low speed prescaler               (APB1)</description><bitOffset>8</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>PPRE2</name><description>APB high speed prescaler               (APB2)</description><bitOffset>11</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>PLLSRC</name><description>PLL entry clock source</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLXTPRE</name><description>HSE divider for PLL entry</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLMUL</name><description>PLL Multiplication Factor</description><bitOffset>18</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>USBPRES</name><description>USB prescaler</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MCO</name><description>Microcontroller clock               output</description><bitOffset>24</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>MCOF</name><description>Microcontroller Clock Output               Flag</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>I2SSRC</name><description>I2S external clock source               selection</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>CIR</name><displayName>CIR</displayName><description>Clock interrupt register           (RCC_CIR)</description><addressOffset>0x8</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>LSIRDYF</name><description>LSI Ready Interrupt flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LSERDYF</name><description>LSE Ready Interrupt flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HSIRDYF</name><description>HSI Ready Interrupt flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HSERDYF</name><description>HSE Ready Interrupt flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>PLLRDYF</name><description>PLL Ready Interrupt flag</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>CSSF</name><description>Clock Security System Interrupt               flag</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LSIRDYIE</name><description>LSI Ready Interrupt Enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSERDYIE</name><description>LSE Ready Interrupt Enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSIRDYIE</name><description>HSI Ready Interrupt Enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSERDYIE</name><description>HSE Ready Interrupt Enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLRDYIE</name><description>PLL Ready Interrupt Enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSIRDYC</name><description>LSI Ready Interrupt Clear</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>LSERDYC</name><description>LSE Ready Interrupt Clear</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>HSIRDYC</name><description>HSI Ready Interrupt Clear</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>HSERDYC</name><description>HSE Ready Interrupt Clear</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>PLLRDYC</name><description>PLL Ready Interrupt Clear</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>CSSC</name><description>Clock security system interrupt               clear</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field></fields></register><register><name>APB2RSTR</name><displayName>APB2RSTR</displayName><description>APB2 peripheral reset register           (RCC_APB2RSTR)</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>SYSCFGRST</name><description>SYSCFG and COMP reset</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM1RST</name><description>TIM1 timer reset</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>SPI1RST</name><description>SPI 1 reset</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM8RST</name><description>TIM8 timer reset</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>USART1RST</name><description>USART1 reset</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM15RST</name><description>TIM15 timer reset</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM16RST</name><description>TIM16 timer reset</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM17RST</name><description>TIM17 timer reset</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>APB1RSTR</name><displayName>APB1RSTR</displayName><description>APB1 peripheral reset register           (RCC_APB1RSTR)</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>TIM2RST</name><description>Timer 2 reset</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM3RST</name><description>Timer 3 reset</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM4RST</name><description>Timer 14 reset</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM6RST</name><description>Timer 6 reset</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM7RST</name><description>Timer 7 reset</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>WWDGRST</name><description>Window watchdog reset</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>SPI2RST</name><description>SPI2 reset</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>SPI3RST</name><description>SPI3 reset</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>USART2RST</name><description>USART 2 reset</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>USART3RST</name><description>USART3 reset</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>UART4RST</name><description>UART 4 reset</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>UART5RST</name><description>UART 5 reset</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C1RST</name><description>I2C1 reset</descripti