MaJerle/stm32f429/00-STM32_SVD/STM32F301x.svd
/bitOffset><bitWidth>1</bitWidth></field><field><name>PR15</name><description>Pending bit 15</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>PR16</name><description>Pending bit 16</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>PR17</name><description>Pending bit 17</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>PR18</name><description>Pending bit 18</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>PR19</name><description>Pending bit 19</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>PR20</name><description>Pending bit 20</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>PR21</name><description>Pending bit 21</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>PR22</name><description>Pending bit 22</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>PR29</name><description>Pending bit 29</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>PR30</name><description>Pending bit 30</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>PR31</name><description>Pending bit 31</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>IMR2</name><displayName>IMR2</displayName><description>Interrupt mask register</description><addressOffset>0x18</addressOffset><size>0x20</size><access>read-write</access><resetValue>0xFFFFFFFC</resetValue><fields><field><name>MR32</name><description>Interrupt Mask on external/internal line               32</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>MR33</name><description>Interrupt Mask on external/internal line               33</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>MR34</name><description>Interrupt Mask on external/internal line               34</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>MR35</name><description>Interrupt Mask on external/internal line               35</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>EMR2</name><displayName>EMR2</displayName><description>Event mask register</description><addressOffset>0x1C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MR32</name><description>Event mask on external/internal line               32</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>MR33</name><description>Event mask on external/internal line               33</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>MR34</name><description>Event mask on external/internal line               34</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>MR35</name><description>Event mask on external/internal line               35</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>RTSR2</name><displayName>RTSR2</displayName><description>Rising Trigger selection           register</description><addressOffset>0x20</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>TR32</name><description>Rising trigger event configuration bit               of line 32</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>TR33</name><description>Rising trigger event configuration bit               of line 33</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FTSR2</name><displayName>FTSR2</displayName><description>Falling Trigger selection           register</description><addressOffset>0x24</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>TR32</name><description>Falling trigger event configuration bit               of line 32</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>TR33</name><description>Falling trigger event configuration bit               of line 33</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>SWIER2</name><displayName>SWIER2</displayName><description>Software interrupt event           register</description><addressOffset>0x28</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>SWIER32</name><description>Software interrupt on line               32</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>SWIER33</name><description>Software interrupt on line               33</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>PR2</name><displayName>PR2</displayName><description>Pending register</description><addressOffset>0x2C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PR32</name><description>Pending bit on line 32</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>PR33</name><description>Pending bit on line 33</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field></fields></register></registers></peripheral><peripheral><name>COMP</name><description>Comparator</description><groupName>COMP</groupName><baseAddress>0x40010020</baseAddress><addressBlock><offset>0x0</offset><size>0x15</size><usage>registers</usage></addressBlock><interrupt><name>SPI1</name><description>SPI1 global interrupt</description><value>35</value></interrupt><registers><register><name>COMP2_CSR</name><displayName>COMP2_CSR</displayName><description>control and status register</description><addressOffset>0x4</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>COMP2EN</name><description>Comparator 2 enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP2MODE</name><description>Comparator 2 mode</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMP2INSEL</name><description>Comparator 2 inverting input               selection</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>COMP2INPSEL</name><description>Comparator 2 non inverted input               selection</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP2INMSEL</name><description>Comparator 1inverting input               selection</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP2_OUT_SEL</name><description>Comparator 2 output               selection</description><bitOffset>10</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>COMP2POL</name><description>Comparator 2 output               polarity</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP2HYST</name><description>Comparator 2 hysteresis</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMP2_BLANKING</name><description>Comparator 2 blanking               source</description><bitOffset>18</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>COMP2OUT</name><description>Comparator 2 output</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>COMP2LOCK</name><description>Comparator 2 lock</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>COMP4_CSR</name><displayName>COMP4_CSR</displayName><description>control and status register</description><addressOffset>0xC</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>COMP4EN</name><description>Comparator 4 enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP4MODE</name><description>Comparator 4 mode</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMP4INSEL</name><description>Comparator 4 inverting input               selection</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>COMP4INPSEL</name><description>Comparator 4 non inverted input               selection</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COM4WINMODE</name><description>Comparator 4 window mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP4_OUT_SEL</name><description>Comparator 4 output               selection</description><bitOffset>10</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>COMP4POL</name><description>Comparator 4 output               polarity</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP4HYST</name><description>Comparator 4 hysteresis</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMP4_BLANKING</name><description>Comparator 4 blanking               source</description><bitOffset>18</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>COMP4OUT</name><description>Comparator 4 output</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>COMP4LOCK</name><description>Comparator 4 lock</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>COMP6_CSR</name><displayName>COMP6_CSR</displayName><description>control and status register</description><addressOffset>0x14</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>COMP6EN</name><description>Comparator 6 enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP6MODE</name><description>Comparator 6 mode</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMP6INSEL</name><description>Comparator 6 inverting input               selection</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>COMP6INPSEL</name><description>Comparator 6 non inverted input               selection</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COM6WINMODE</name><description>Comparator 6 window mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP6_OUT_SEL</name><description>Comparator 6 output               selection</description><bitOffset>10</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>COMP6POL</name><description>Comparator 6 output               polarity</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP6HYST</name><description>Comparator 6 hysteresis</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMP6_BLANKING</name><description>Comparator 6 blanking               source</description><bitOffset>18</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>COMP6OUT</name><description>Comparator 6 output</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>COMP6LOCK</name><description>Comparator 6 lock</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register></registers></peripheral><peripheral><name>PWR</name><description>Power control</description><groupName>PWR</groupName><baseAddress>0x40007000</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>SPI2</name><description>SPI2 global interrupt</description><value>36</value></interrupt><registers><register><name>CR</name><displayName>CR</displayName><description>power control register</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>LPDS</name><description>Low-power deep sleep</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>PDDS</name><description>Power down deepsleep</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>CWUF</name><description>Clear wakeup flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>CSBF</name><description>Clear standby flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>PVDE</name><description>Power voltage detector               enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>PLS</name><description>PVD level selection</description><bitOffset>5</bitOffset><bitWidth>3</bitWidth></field><field><name>DBP</name><description>Disable backup domain write               protection</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CSR</name><displayName>CSR</displayName><description>power control/status register</description><addressOffset>0x4</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>WUF</name><description>Wakeup flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SBF</name><description>Standby flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>PVDO</name><description>PVD output</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>EWUP1</name><description>Enable WKUP1 pin</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EWUP2</name><description>Enable WKUP2 pin</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register></registers></peripheral><peripheral><name>I2C1</name><description>Inter-integrated circuit</description><groupName>I2C</groupName><baseAddress>0x40005400</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><registers><register><name>CR1</name><displayName>CR1</displayName><description>Control register 1</description><addressOffset>0x0</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>PE</name><description>Peripheral enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXIE</name><description>TX Interrupt enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RXIE</name><description>RX Interrupt enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ADDRIE</name><description>Address match interrupt enable (slave               only)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NACKIE</name><description>Not acknowledge received interrupt               enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STOPIE</name><description>STOP detection Interrupt               enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TCIE</name><description>Transfer Complete interrupt               enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ERRIE</name><description>Error interrupts enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DNF</name><description>Digital noise filter</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>ANFOFF</name><description>Analog noise filter OFF</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SWRST</name><description>Software reset</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>TXDMAEN</name><description>DMA transmission requests               enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RXDMAEN</name><description>DMA reception requests               enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SBC</name><description>Slave byte control</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NOSTRETCH</name><description>Clock stretching disable</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WUPEN</name><description>Wakeup from STOP enable</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GCEN</name><description>General call enable</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SMBHEN</name><description>SMBus Host address enable</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SMBDEN</name><description>SMBus Device Default address               enable</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ALERTEN</name><description>SMBUS alert enable</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PECEN</name><description>PEC enable</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>CR2</name><displayName>CR2</displayName><description>Control register 2</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PECBYTE</name><description>Packet error checking byte</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>AUTOEND</name><description>Automatic end mode (master               mode)</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>RELOAD</name><description>NBYTES reload mode</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>NBYTES</name><description>Number of bytes</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>NACK</name><description>NACK generation (slave               mode)</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>STOP</name><description>Stop generation (master               mode)</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>START</name><description>Start generation</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>HEAD10R</name><description>10-bit address header only read               direction (master receiver mode)</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>ADD10</name><description>10-bit addressing mode (master               mode)</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>RD_WRN</name><description>Transfer direction (master               mode)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>SADD8</name><description>Slave address bit 9:8 (master               mode)</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>SADD1</name><description>Slave address bit 7:1 (master               mode)</description><bitOffset>1</bitOffset><bitWidth>7</bitWidth></field><field><name>SADD0</name><description>Slave address bit 0 (master               mode)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>OAR1</name><displayName>OAR1</displayName><description>Own address register 1</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>OA1_0</name><description>Interface address</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>OA1_1</name><description>Interface address</description><bitOffset>1</bitOffset><bitWidth>7</bitWidth></field><field><name>OA1_8</name><description>Interface address</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>OA1MODE</name><description>Own Address 1 10-bit mode</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>OA1EN</name><description>Own Address 1 enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>OAR2</name><displayName>OAR2</displayName><description>Own address register 2</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>OA2</name><description>Interface address</description><bitOffset>1</bitOffset><bitWidth>7</bitWidth></field><field><name>OA2MSK</name><description>Own Address 2 masks</description><bitOffset>8</bitOffset><bitWidth>3</bitWidth></field><field><name>OA2EN</name><description>Own Address 2 enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>TIMINGR</name><displayName>TIMINGR</displayName><description>Timing register</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>SCLL</name><description>SCL low period (master               mode)</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field><field><name>SCLH</name><description>SCL high period (master               mode)</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>SDADEL</name><description>Data hold time</description><bitOffset>16</bitOffset><bitWidth>4</bitWidth></field><field><name>SCLDEL</name><description>Data setup time</description><bitOffset>20</bitOffset><bitWidth>4</bitWidth></field><field><name>PRESC</name><description>Timing prescaler</description><bitOffset>28</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>TIMEOUTR</name><displayName>TIMEOUTR</displayName><description>Status register 1</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>TIMEOUTA</name><description>Bus timeout A</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field><field><name>TIDLE</name><description>Idle clock timeout               detection</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>TIMOUTEN</name><description>Clock timeout enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>TIMEOUTB</name><description>Bus timeout B</description><bitOffset>16</bitOffset><bitWidth>12</bitWidth></field><field><name>TEXTEN</name><description>Extended clock timeout               enable</description><bitOffset>31</bi