MaJerle/stm32f429/00-STM32_SVD/STM32F301x.svd
tOffset><bitWidth>1</bitWidth></field></fields></register><register><name>ISR</name><displayName>ISR</displayName><description>Interrupt and Status register</description><addressOffset>0x18</addressOffset><size>0x20</size><resetValue>0x00000001</resetValue><fields><field><name>ADDCODE</name><description>Address match code (Slave               mode)</description><bitOffset>17</bitOffset><bitWidth>7</bitWidth><access>read-only</access></field><field><name>DIR</name><description>Transfer direction (Slave               mode)</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>BUSY</name><description>Bus busy</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>ALERT</name><description>SMBus alert</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TIMEOUT</name><description>Timeout or t_low detection               flag</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>PECERR</name><description>PEC Error in reception</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>OVR</name><description>Overrun/Underrun (slave               mode)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>ARLO</name><description>Arbitration lost</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>BERR</name><description>Bus error</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TCR</name><description>Transfer Complete Reload</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TC</name><description>Transfer Complete (master               mode)</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>STOPF</name><description>Stop detection flag</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>NACKF</name><description>Not acknowledge received               flag</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>ADDR</name><description>Address matched (slave               mode)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>RXNE</name><description>Receive data register not empty               (receivers)</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TXIS</name><description>Transmit interrupt status               (transmitters)</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXE</name><description>Transmit data register empty               (transmitters)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>ICR</name><displayName>ICR</displayName><description>Interrupt clear register</description><addressOffset>0x1C</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x00000000</resetValue><fields><field><name>ALERTCF</name><description>Alert flag clear</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>TIMOUTCF</name><description>Timeout detection flag               clear</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>PECCF</name><description>PEC Error flag clear</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>OVRCF</name><description>Overrun/Underrun flag               clear</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>ARLOCF</name><description>Arbitration lost flag               clear</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>BERRCF</name><description>Bus error flag clear</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>STOPCF</name><description>Stop detection flag clear</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>NACKCF</name><description>Not Acknowledge flag clear</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>ADDRCF</name><description>Address Matched flag clear</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>PECR</name><displayName>PECR</displayName><description>PEC register</description><addressOffset>0x20</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>PEC</name><description>Packet error checking               register</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>RXDR</name><displayName>RXDR</displayName><description>Receive data register</description><addressOffset>0x24</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>RXDATA</name><description>8-bit receive data</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>TXDR</name><displayName>TXDR</displayName><description>Transmit data register</description><addressOffset>0x28</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>TXDATA</name><description>8-bit transmit data</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register></registers></peripheral><peripheral derivedFrom="I2C1"><name>I2C2</name><baseAddress>0x40005800</baseAddress><interrupt><name>TAMP_STAMP</name><description>Tamper and TimeStamp interrupts</description><value>2</value></interrupt><interrupt><name>EXTI0</name><description>EXTI Line0 interrupt</description><value>6</value></interrupt><interrupt><name>EXTI1</name><description>EXTI Line3 interrupt</description><value>7</value></interrupt><interrupt><name>EXTI2_TSC</name><description>EXTI Line2 and Touch sensing
        interrupts</description><value>8</value></interrupt><interrupt><name>EXTI3</name><description>EXTI Line3 interrupt</description><value>9</value></interrupt><interrupt><name>EXTI4</name><description>EXTI Line4 interrupt</description><value>10</value></interrupt><interrupt><name>EXTI9_5</name><description>EXTI Line5 to Line9 interrupts</description><value>23</value></interrupt><interrupt><name>I2C1_EV_EXTI23</name><description>I2C1 event interrupt and EXTI Line23
        interrupt</description><value>31</value></interrupt><interrupt><name>USART1_EXTI25</name><description>USART1 global interrupt and EXTI Line 25
        interrupt</description><value>37</value></interrupt><interrupt><name>USART2_EXTI26</name><description>USART2 global interrupt and EXTI Line 26
        interrupt</description><value>38</value></interrupt><interrupt><name>USART3_EXTI28</name><description>USART3 global interrupt and EXTI Line 28
        interrupt</description><value>39</value></interrupt><interrupt><name>EXTI15_10</name><description>EXTI Line15 to Line10 interrupts</description><value>40</value></interrupt><interrupt><name>UART4_EXTI34</name><description>UART4 global and EXTI Line 34
        interrupts</description><value>52</value></interrupt><interrupt><name>UART5_EXTI35</name><description>UART5 global and EXTI Line 35
        interrupts</description><value>53</value></interrupt><interrupt><name>USB_WKUP_EXTI</name><description>USB wakeup from Suspend and EXTI Line
        18</description><value>76</value></interrupt></peripheral><peripheral derivedFrom="I2C1"><name>I2C3</name><baseAddress>0x40007800</baseAddress><interrupt><name>TAMP_STAMP</name><description>Tamper and TimeStamp interrupts</description><value>2</value></interrupt><interrupt><name>EXTI0</name><description>EXTI Line0 interrupt</description><value>6</value></interrupt><interrupt><name>EXTI1</name><description>EXTI Line3 interrupt</description><value>7</value></interrupt><interrupt><name>EXTI2_TSC</name><description>EXTI Line2 and Touch sensing
        interrupts</description><value>8</value></interrupt><interrupt><name>EXTI3</name><description>EXTI Line3 interrupt</description><value>9</value></interrupt><interrupt><name>EXTI4</name><description>EXTI Line4 interrupt</description><value>10</value></interrupt><interrupt><name>EXTI9_5</name><description>EXTI Line5 to Line9 interrupts</description><value>23</value></interrupt><interrupt><name>I2C1_EV_EXTI23</name><description>I2C1 event interrupt and EXTI Line23
        interrupt</description><value>31</value></interrupt><interrupt><name>USART1_EXTI25</name><description>USART1 global interrupt and EXTI Line 25
        interrupt</description><value>37</value></interrupt><interrupt><name>USART2_EXTI26</name><description>USART2 global interrupt and EXTI Line 26
        interrupt</description><value>38</value></interrupt><interrupt><name>USART3_EXTI28</name><description>USART3 global interrupt and EXTI Line 28
        interrupt</description><value>39</value></interrupt><interrupt><name>EXTI15_10</name><description>EXTI Line15 to Line10 interrupts</description><value>40</value></interrupt><interrupt><name>UART4_EXTI34</name><description>UART4 global and EXTI Line 34
        interrupts</description><value>52</value></interrupt><interrupt><name>UART5_EXTI35</name><description>UART5 global and EXTI Line 35
        interrupts</description><value>53</value></interrupt><interrupt><name>USB_WKUP_EXTI</name><description>USB wakeup from Suspend and EXTI Line
        18</description><value>76</value></interrupt></peripheral><peripheral><name>IWDG</name><description>Independent watchdog</description><groupName>IWDG</groupName><baseAddress>0x40003000</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>COMP123</name><description>COMP1 &amp; COMP2 &amp; COMP3 interrupts
        combined with EXTI Lines 21, 22 and 29
        interrupts</description><value>64</value></interrupt><interrupt><name>COMP456</name><description>COMP4 &amp; COMP5 &amp; COMP6 interrupts
        combined with EXTI Lines 30, 31 and 32
        interrupts</description><value>65</value></interrupt><interrupt><name>COMP7</name><description>COMP7 interrupt combined with EXTI Line 33
        interrupt</description><value>66</value></interrupt><registers><register><name>KR</name><displayName>KR</displayName><description>Key register</description><addressOffset>0x0</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x00000000</resetValue><fields><field><name>KEY</name><description>Key value</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>PR</name><displayName>PR</displayName><description>Prescaler register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PR</name><description>Prescaler divider</description><bitOffset>0</bitOffset><bitWidth>3</bitWidth></field></fields></register><register><name>RLR</name><displayName>RLR</displayName><description>Reload register</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000FFF</resetValue><fields><field><name>RL</name><description>Watchdog counter reload               value</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>SR</name><displayName>SR</displayName><description>Status register</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>PVU</name><description>Watchdog prescaler value               update</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>RVU</name><description>Watchdog counter reload value               update</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>WVU</name><description>Watchdog counter window value               update</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>WINR</name><displayName>WINR</displayName><description>Window register</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000FFF</resetValue><fields><field><name>WIN</name><description>Watchdog counter window               value</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register></registers></peripheral><peripheral><name>WWDG</name><description>Window watchdog</description><groupName>WWDG</groupName><baseAddress>0x40002C00</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>PVD</name><description>PVD through EXTI line detection
        interrupt</description><value>1</value></interrupt><registers><register><name>CR</name><displayName>CR</displayName><description>Control register</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000007F</resetValue><fields><field><name>T</name><description>7-bit counter</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth></field><field><name>WDGA</name><description>Activation bit</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CFR</name><displayName>CFR</displayName><description>Configuration register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000007F</resetValue><fields><field><name>EWI</name><description>Early wakeup interrupt</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>WDGTB</name><description>Timer base</description><bitOffset>7</bitOffset><bitWidth>2</bitWidth></field><field><name>W</name><description>7-bit window value</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth></field></fields></register><register><name>SR</name><displayName>SR</displayName><description>Status register</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>EWIF</name><description>Early wakeup interrupt               flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register></registers></peripheral><peripheral><name>RTC</name><description>Real-time clock</description><groupName>RTC</groupName><baseAddress>0x40002800</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>USB_HP_CAN_TX</name><description>USB High Priority/CAN_TX
        interrupts</description><value>19</value></interrupt><interrupt><name>USB_LP_CAN_RX0</name><description>USB Low Priority/CAN_RX0
