MaJerle/stm32f429/00-STM32_SVD/STM32F301x.svd
tOffset><bitWidth>1</bitWidth></field><field><name>USER</name><description>USER</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>THREAD</name><description>THREAD</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>HFRDY</name><description>HFRDY</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>MMRDY</name><description>MMRDY</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>BFRDY</name><description>BFRDY</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>MONRDY</name><description>MONRDY</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>LSPEN</name><description>LSPEN</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>ASPEN</name><description>ASPEN</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FPCAR</name><displayName>FPCAR</displayName><description>FP Context Address Register</description><addressOffset>0x1B0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>ADDRESS</name><description>ADDRESS</description><bitOffset>3</bitOffset><bitWidth>29</bitWidth></field></fields></register><register><name>FPDSCR</name><displayName>FPDSCR</displayName><description>FP Default Status Control           Register</description><addressOffset>0x1B4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>RMode</name><description>RMode</description><bitOffset>22</bitOffset><bitWidth>2</bitWidth></field><field><name>FZ</name><description>FZ</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>DN</name><description>DN</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>AHP</name><description>AHP</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>MVFR0</name><displayName>MVFR0</displayName><description>Media and VFP Feature Register           0</description><addressOffset>0x1B8</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x10110021</resetValue><fields><field><name>A_SIMD</name><description>A_SIMD registers</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field><field><name>Single_precision</name><description>Single_precision</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>Double_precision</name><description>Double_precision</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>FP_exception_trapping</name><description>FP exception trapping</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field><field><name>Divide</name><description>Divide</description><bitOffset>16</bitOffset><bitWidth>4</bitWidth></field><field><name>Square_root</name><description>Square root</description><bitOffset>20</bitOffset><bitWidth>4</bitWidth></field><field><name>Short_vectors</name><description>Short vectors</description><bitOffset>24</bitOffset><bitWidth>4</bitWidth></field><field><name>FP_rounding_modes</name><description>FP rounding modes</description><bitOffset>28</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>MVFR1</name><displayName>MVFR1</displayName><description>Media and VFP Feature Register           1</description><addressOffset>0x1BC</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x11000011</resetValue><fields><field><name>FtZ_mode</name><description>FtZ mode</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field><field><name>D_NaN_mode</name><description>D_NaN mode</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>FP_HPFP</name><description>FP HPFP</description><bitOffset>24</bitOffset><bitWidth>4</bitWidth></field><field><name>FP_fused_MAC</name><description>FP fused MAC</description><bitOffset>28</bitOffset><bitWidth>4</bitWidth></field></fields></register></registers></peripheral><peripheral><name>DBGMCU</name><description>Debug support</description><groupName>DBGMCU</groupName><baseAddress>0xE0042000</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>WWDG</name><description>Window Watchdog interrupt</description><value>0</value></interrupt><registers><register><name>IDCODE</name><displayName>IDCODE</displayName><description>MCU Device ID Code Register</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x0</resetValue><fields><field><name>DEV_ID</name><description>Device Identifier</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field><field><name>REV_ID</name><description>Revision Identifier</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CR</name><displayName>CR</displayName><description>Debug MCU Configuration           Register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>DBG_SLEEP</name><description>Debug Sleep mode</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_STOP</name><description>Debug Stop Mode</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_STANDBY</name><description>Debug Standby Mode</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TRACE_IOEN</name><description>Trace pin assignment               control</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>TRACE_MODE</name><description>Trace pin assignment               control</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth></field></fields></register><register><name>APB1FZ</name><displayName>APB1FZ</displayName><description>APB Low Freeze Register</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>DBG_TIM2_STOP</name><description>Debug Timer 2 stopped when Core is               halted</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_TIM3_STOP</name><description>Debug Timer 3 stopped when Core is               halted</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_TIM4_STOP</name><description>Debug Timer 4 stopped when Core is               halted</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_TIM5_STOP</name><description>Debug Timer 5 stopped when Core is               halted</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_TIM6_STOP</name><description>Debug Timer 6 stopped when Core is               halted</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_TIM7_STOP</name><description>Debug Timer 7 stopped when Core is               halted</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_TIM12_STOP</name><description>Debug Timer 12 stopped when Core is               halted</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_TIM13_STOP</name><description>Debug Timer 13 stopped when Core is               halted</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_TIMER14_STOP</name><description>Debug Timer 14 stopped when Core is               halted</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_TIM18_STOP</name><description>Debug Timer 18 stopped when Core is               halted</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_RTC_STOP</name><description>Debug RTC stopped when Core is               halted</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_WWDG_STOP</name><description>Debug Window Wachdog stopped when Core               is halted</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_IWDG_STOP</name><description>Debug Independent Wachdog stopped when               Core is halted</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C1_SMBUS_TIMEOUT</name><description>SMBUS timeout mode stopped when Core is               halted</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C2_SMBUS_TIMEOUT</name><description>SMBUS timeout mode stopped when Core is               halted</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_CAN_STOP</name><description>Debug CAN stopped when core is               halted</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>APB2FZ</name><displayName>APB2FZ</displayName><description>APB High Freeze Register</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>DBG_TIM15_STOP</name><description>Debug Timer 15 stopped when Core is               halted</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_TIM16_STOP</name><description>Debug Timer 16 stopped when Core is               halted</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_TIM17_STO</name><description>Debug Timer 17 stopped when Core is               halted</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_TIM19_STOP</name><description>Debug Timer 19 stopped when Core is               halted</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field></fields></register></registers></peripheral><peripheral><name>TIM1</name><description>Advanced timer</description><groupName>TIMs</groupName><baseAddress>0x40012C00</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>RTC_WKUP</name><description>RTC Wakeup interrupt through the EXTI
